/*
alert(52+273)
//325 숫자니까
alert('52'+273)
//52273 문자로 받아들임
alert(52+'273')
//52273 문자로 받아드림
alert('52'+'273')
//52273 문자ㅣㄴ까
alert(5+3*2)
//11 숫자니까
alert(10>5)
//true 10이 더 크니까
alert(10<5)
//false 10이 더 크니까
alert(5>=5)
//true 5 이상 5니까
alert('12'==12)
//true 문자로 받아들이니까
alert(12>='12')
//true 문자로 받아들이는데 그 같은게 포함인까
alert(10>5 && 20>15)
//true 10이 더크고 20이 더 크니까
alert(10>=10 && 20>30)
//false 10이 크같이긴하나 20이 작으니까
alert(10>5 || 20>30)

//true 10이 더 크거나 20이 더 커야하는데 하나만 충족해도 괜찬ㄶㅇ늬가
*/

console.log(1 << 3 + 1 & 1 << 5)
console.log(1 << 3 + 1 & 1 << 4)